// tslint:disable: max-line-length
export const commandsText = `
/schedule - розклад сеансів
/subscribe - підписатись на оновлення
/unsubscribe - відписатись від оновленнь
/help - допомога
`;
export const helpMsg = `
Я вмію виконувати наступні команди:
${commandsText}
Контакти: https://fb.me/snipter
`;
export const startMsg = `
Привіт 😊! Я збираю інформацію про сеанси фільмів в Кременчуці і можу відправляти вам розклад в зручному форматі. Я можу виконувати наступні команди:
${commandsText}
Контакти: https://fb.me/snipter
`;
export const sorryMsg = `
Вибате, але я не зрозумів вас 😕. Я можу виконувати наступні команди:
${commandsText}
`;
export const serviceErrMsg = `
Вибачте, але сервіс тимчасово недоступний 😕
`;
export const cmdParamErr = `
Невірний параметр команди 😕
`;
export const waitMsg = `
Хвилинку...
`;
export const loginedMsg = `
Ви успішно авторизовані у якості адміну! 😊
`;
export const logoutMsg = `
Ви успішно вийшли з системи 😊
`;
export const logoutErrMsg = `
Помилка виходу з системи 😕
`;
export const subscribeMsg = `
Ви підписались на оновлення 😊. Тепер ви будете отримувати інформацію про нові фільми в кінотеатрі
`;
export const unsubscribeMsg = `
Ви відписались від оновлень 😕. Підписку завжди можна відновити виконавши команду /subscribe
`;
// tslint:enable: max-line-length
//# sourceMappingURL=msg.js.map